src/example/InformationRegisters/ЛогHTTPЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛогHTTPЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>HTTPСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HTTPСервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/example/InformationRegisters/ЛогHTTPЗапросов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создаёт запись лога входящего HTTP-запроса.
// Заполняются измерения HTTPСервис, ИдентификаторЗапроса,
// стандартный реквизит Период и ресурсы Метод, Ресурс, Запрос.
//
// Параметры:
//  Контекст - Структура - контекст обработки HTTP-запроса. См. HTTPСервисЗапросыСлужебный.НовыйКонтекст.
//
Процедура ЗафиксироватьЗапрос(Контекст) Экспорт
	
	ЗаписьЛога = РегистрыСведений.ЛогHTTPЗапросов.СоздатьМенеджерЗаписи();
	ЗаписьЛога.Период = ТекущаяДатаСеанса();
	ЗаписьЛога.HTTPСервис = Контекст.HTTPСервис;
	ЗаписьЛога.ИдентификаторЗапроса = Контекст.ИдентификаторЗапроса;
	ЗаписьЛога.Метод = Контекст.Запрос.Метод;
	ЗаписьЛога.Ресурс = Контекст.Запрос.ОтносительныйURL;
	ЗаписьЛога.Запрос = СобратьТекстЗапроса(Контекст.Запрос);
	
	Попытка
		ЗаписьЛога.Записать();
	Исключение
		ЗаписатьОшибкуЛога(
			НСтр("ru = 'Лог HTTP запросов.Фиксация запроса'"),
			ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

// Дописывает в найденную запись лога текст ответа и код состояния.
// Поиск выполняется по измерениям HTTPСервис и ИдентификаторЗапроса.
//
// Параметры:
//  Контекст - Структура - контекст обработки HTTP-запроса. См. HTTPСервисЗапросыСлужебный.НовыйКонтекст.
//
Процедура ЗафиксироватьОтвет(Контекст) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЛогHTTPЗапросов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.HTTPСервис.Установить(Контекст.HTTPСервис);
	НаборЗаписей.Отбор.ИдентификаторЗапроса.Установить(Контекст.ИдентификаторЗапроса);
	НаборЗаписей.Прочитать();
	
	Если Не ЗначениеЗаполнено(НаборЗаписей) Тогда
		Возврат;
	КонецЕсли;
		
	ДанныеОтвета = ДанныеОтветаИзКонтекста(Контекст);
	
	ЗаписьЛога = НаборЗаписей[0];
	ЗаписьЛога.Ответ = ДанныеОтвета.Текст;
	ЗаписьЛога.КодСостояния = ДанныеОтвета.КодСостояния;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписатьОшибкуЛога(
		НСтр("ru = 'Лог HTTP запросов.Фиксация ответа'"),
		ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СобратьТекстЗапроса(Запрос)
	
	Строки = Новый Массив;
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Метод: %1'"), Запрос.Метод));
	Строки.Добавить(СтрШаблон(НСтр("ru = 'URL: %1%2'"), Запрос.БазовыйURL, Запрос.ОтносительныйURL));
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Заголовки:%1%2'"), Символы.ПС, ТекстСоответствия(Запрос.Заголовки)));
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Параметры URL:%1%2'"), Символы.ПС, ТекстСоответствия(Запрос.ПараметрыURL)));
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Параметры запроса:%1%2'"), Символы.ПС, ТекстСоответствия(Запрос.ПараметрыЗапроса)));
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Тело:%1%2'"), Символы.ПС, Запрос.ТелоКакСтрока));
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Функция ДанныеОтветаИзКонтекста(Контекст)
	
	ОтветСервиса = Контекст.Результат;
	КодСостояния = ОтветСервиса.КодСостояния;
	Тело = "";
	
	Если ТипЗнч(ОтветСервиса.Тело) = Тип("Строка") Тогда
		Тело = ОтветСервиса.Тело;
	КонецЕсли;
	
	Строки = Новый Массив;
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Код состояния: %1'"), Формат(КодСостояния, "ЧЦ=3; ЧН=0; ЧГ=0")));
	
	Если ЗначениеЗаполнено(ОтветСервиса.Причина) Тогда
		Строки.Добавить(СтрШаблон(НСтр("ru = 'Причина: %1'"), ОтветСервиса.Причина));
	КонецЕсли;
	
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Заголовки:%1%2'"), Символы.ПС, ТекстСоответствия(ОтветСервиса.Заголовки)));
	Строки.Добавить(СтрШаблон(НСтр("ru = 'Тело:%1%2'"), Символы.ПС, Тело));
	ДобавитьОшибкиКонтекста(Строки, Контекст);
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("КодСостояния", КодСостояния);
	ДанныеОтвета.Вставить("Текст", СтрСоединить(Строки, Символы.ПС));
	Возврат ДанныеОтвета;
	
КонецФункции

Процедура ДобавитьОшибкиКонтекста(Строки, Контекст)
	
	ДобавитьСписокОшибок(Строки, НСтр("ru = 'Ошибки клиента:'"), Контекст.ОшибкиКлиента);
	ДобавитьСписокОшибок(Строки, НСтр("ru = 'Ошибки прав доступа:'"), Контекст.ОшибкиПравДоступа);
	ДобавитьСписокОшибок(Строки, НСтр("ru = 'Ошибки сервера:'"), Контекст.ОшибкиСервера);
	
КонецПроцедуры

Процедура ДобавитьСписокОшибок(Строки, Заголовок, Ошибки)
	
	Если Не ЗначениеЗаполнено(Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	Строки.Добавить(Заголовок);
	Для Каждого ТекстОшибки Из Ошибки Цикл
		Строки.Добавить(ТекстОшибки);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстСоответствия(Значения)
	
	Если Значения = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Строки = Новый Массив;
	Для Каждого КлючИЗначение Из Значения Цикл
		Строки.Добавить(СтрШаблон("%1: %2", КлючИЗначение.Ключ, КлючИЗначение.Значение));
	КонецЦикла;
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

Процедура ЗаписатьОшибкуЛога(ИмяСобытия, ИнформацияОбОшибке)
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.РегистрыСведений.ЛогHTTPЗапросов,
		,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
